In [1]:
## Defining two data-frames
data_1 = data.frame(id = c('b', 'b', 'a', 'c', 'a', 'a', 'b'), x = sample(1:100, 7))
data_2 = data.frame(id = c('a', 'b', 'd'), y = sample(1:100, 3))

# Inner Join

In [6]:
data_inner = merge(data_1, data_2, by = c('id'))
data_inner

  id x   y
1 a   97  1
2 a   86  1
3 a   95  1
4 b   92 99
5 b  100 99
6 b   77 99

# Left Join

In [2]:
data_left = merge(data_1, data_2, by = c('id'), all.x = TRUE)
data_left

  id x   y
1 a  100 12
2 a   99 12
3 a    8 12
4 b   25 86
5 b   92 86
6 b   69 86
7 c   47 NA

# Right Join

In [3]:
data_right = merge(data_1, data_2, by = c('id'), all.y = TRUE)
data_right

  id x   y
1 a  100 12
2 a   99 12
3 a    8 12
4 b   25 86
5 b   92 86
6 b   69 86
7 d   NA 89

# Data Stacking

In [4]:
## Defining two data-frames
data_1 = data.frame(id = c('b', 'b', 'a', 'c', 'a', 'a', 'b'), x = sample(1:100, 7))
data_2 = data.frame(id = c('a', 'b', 'd'), x = sample(1:100, 3))

data_combined = rbind(data_1, data_2)
data_combined

   id x
1  b  59
2  b  28
3  a  54
4  c  69
5  a  44
6  a  12
7  b  19
8  a  34
9  b  54
10 d  80

# Selecting Rows Based on Conditionals

In [5]:
## Reading titanic data-file
titanic = read.csv(file = 'titanic.csv', header = TRUE)
head(titanic)

  Survived Pclass Name                                               Sex    Age
1 0        3      Mr. Owen Harris Braund                             male   22
2 1        1      Mrs. John Bradley (Florence Briggs Thayer) Cumings female 38
3 1        3      Miss. Laina Heikkinen                              female 26
4 1        1      Mrs. Jacques Heath (Lily May Peel) Futrelle        female 35
5 0        3      Mr. William Henry Allen                            male   35
6 0        3      Mr. James Moran                                    male   27
  Siblings_Spouses.Aboard Parents_Children_Aboard Fare
1 1                       0                        7.2500
2 1                       0                       71.2833
3 0                       0                        7.9250
4 1                       0                       53.1000
5 0                       0                        8.0500
6 0                       0                        8.4583

In [6]:
## Showing top two rows where Sex is female
head(titanic[which(titanic$Sex == 'female'), ], 2)

  Survived Pclass Name                                               Sex    Age
2 1        1      Mrs. John Bradley (Florence Briggs Thayer) Cumings female 38
3 1        3      Miss. Laina Heikkinen                              female 26
  Siblings_Spouses.Aboard Parents_Children_Aboard Fare
2 1                       0                       71.2833
3 0                       0                        7.9250

In [7]:
## Filtering rows based on multiple conditions
titanic[which(titanic$Sex == 'female' & titanic$Age >= 60), ]

    Survived Pclass Name                                            Sex    Age
274 1        1      Miss. Kornelia Theodosia Andrews                female 63
365 1        1      Mrs. Frank Manley (Anna Sophia Atkinson) Warren female 60
481 1        3      Mrs. (Hedwig) Turkula                           female 63
562 0        3      Miss. (Marion Ogden) Meanwell                   female 62
826 1        1      Mrs. George Nelson (Martha Evelyn) Stone        female 62
    Siblings_Spouses.Aboard Parents_Children_Aboard Fare
274 1                       0                       77.9583
365 1                       0                       75.2500
481 0                       0                        9.5875
562 0                       0                        8.0500
826 0                       0                       80.0000

# Replacing Values

In [9]:
## Replacing female by woman
titanic$Sex[which(titanic$Sex == 'female')] = 'woman'
head(titanic$Sex)

[1] "male"  "woman" "woman" "woman" "male"  "male"

In [10]:
## Replacing female and male with woman and man
titanic$Sex[which(titanic$Sex == 'female')] = 'woman'
titanic$Sex[which(titanic$Sex == 'male')] = 'man'
head(titanic$Sex)

[1] "man"   "woman" "woman" "woman" "man"   "man"

# Renaming Columns

In [13]:
# Renaming the Pclass column
names(titanic)[2] = 'Passenger Class'
head(titanic)

  Survived Passenger Class Name
1 0        3               Mr. Owen Harris Braund
2 1        1               Mrs. John Bradley (Florence Briggs Thayer) Cumings
3 1        3               Miss. Laina Heikkinen
4 1        1               Mrs. Jacques Heath (Lily May Peel) Futrelle
5 0        3               Mr. William Henry Allen
6 0        3               Mr. James Moran
  Sex   Age Siblings_Spouses.Aboard Parents_Children_Aboard Fare
1 man   22  1                       0                        7.2500
2 woman 38  1                       0                       71.2833
3 woman 26  0                       0                        7.9250
4 woman 35  1                       0                       53.1000
5 man   35  0                       0                        8.0500
6 man   27  0                       0                        8.4583

In [16]:
## Renaming Pclass and Sex
names(titanic)[c(2, 4)] = c('Passenger Class', 'Gender')
head(titanic)

  Survived Passenger Class Name
1 0        3               Mr. Owen Harris Braund
2 1        1               Mrs. John Bradley (Florence Briggs Thayer) Cumings
3 1        3               Miss. Laina Heikkinen
4 1        1               Mrs. Jacques Heath (Lily May Peel) Futrelle
5 0        3               Mr. William Henry Allen
6 0        3               Mr. James Moran
  Gender Age Siblings_Spouses.Aboard Parents_Children_Aboard Fare
1 man    22  1                       0                        7.2500
2 woman  38  1                       0                       71.2833
3 woman  26  0                       0                        7.9250
4 woman  35  1                       0                       53.1000
5 man    35  0                       0                        8.0500
6 man    27  0                       0                        8.4583

# Finding Minimum, Maximum, Sum, Average, and Count

In [17]:
## Finding the maximum age
max(titanic$Age)

[1] 80

In [18]:
## Finding the minimum age
min(titanic$Age)

[1] 0.42

In [19]:
## Computing the average age
mean(titanic$Age)

[1] 29.47144

In [21]:
## Computing the sum of all ages
sum(titanic$Age)

[1] 26141.17

In [23]:
## Counting the numner of ages
length(titanic$Age)

[1] 887

# Finding Unique Values

In [24]:
## Finding unique values of Gender
unique(titanic$Gender)

[1] "man"   "woman"

In [25]:
## Counting the number of unique calues of Gender
table(titanic$Gender)

  man woman
  573   314

# Deleting a Column

In [26]:
## Dropping the age column
head(subset(titanic, select = -c(Age)))

  Survived Passenger Class Name
1 0        3               Mr. Owen Harris Braund
2 1        1               Mrs. John Bradley (Florence Briggs Thayer) Cumings
3 1        3               Miss. Laina Heikkinen
4 1        1               Mrs. Jacques Heath (Lily May Peel) Futrelle
5 0        3               Mr. William Henry Allen
6 0        3               Mr. James Moran
  Gender Siblings_Spouses.Aboard Parents_Children_Aboard Fare
1 man    1                       0                        7.2500
2 woman  1                       0                       71.2833
3 woman  0                       0                        7.9250
4 woman  1                       0                       53.1000
5 man    0                       0                        8.0500
6 man    0                       0                        8.4583

In [27]:
## Dropping Age and Gender
head(subset(titanic, select = -c(Age, Gender)))

  Survived Passenger Class Name
1 0        3               Mr. Owen Harris Braund
2 1        1               Mrs. John Bradley (Florence Briggs Thayer) Cumings
3 1        3               Miss. Laina Heikkinen
4 1        1               Mrs. Jacques Heath (Lily May Peel) Futrelle
5 0        3               Mr. William Henry Allen
6 0        3               Mr. James Moran
  Siblings_Spouses.Aboard Parents_Children_Aboard Fare
1 1                       0                        7.2500
2 1                       0                       71.2833
3 0                       0                        7.9250
4 1                       0                       53.1000
5 0                       0                        8.0500
6 0                       0                        8.4583

# Deleting a Row

In [29]:
## Removing all man rows
head(subset(titanic, Gender != 'man'))

   Survived Passenger Class Name
2  1        1               Mrs. John Bradley (Florence Briggs Thayer) Cumings
3  1        3               Miss. Laina Heikkinen
4  1        1               Mrs. Jacques Heath (Lily May Peel) Futrelle
9  1        3               Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson
10 1        2               Mrs. Nicholas (Adele Achem) Nasser
11 1        3               Miss. Marguerite Rut Sandstrom
   Gender Age Siblings_Spouses.Aboard Parents_Children_Aboard Fare
2  woman  38  1                       0                       71.2833
3  woman  26  0                       0                        7.9250
4  woman  35  1                       0                       53.1000
9  woman  27  0                       2                       11.1333
10 woman  14  1                       0                       30.0708
11 woman   4  1                       1                       16.7000

In [30]:
## Removing all woman rows
head(subset(titanic, Gender != 'woman'))

   Survived Passenger Class Name                          Gender Age
1  0        3               Mr. Owen Harris Braund        man    22
5  0        3               Mr. William Henry Allen       man    35
6  0        3               Mr. James Moran               man    27
7  0        1               Mr. Timothy J McCarthy        man    54
8  0        3               Master. Gosta Leonard Palsson man     2
13 0        3               Mr. William Henry Saundercock man    20
   Siblings_Spouses.Aboard Parents_Children_Aboard Fare
1  1                       0                        7.2500
5  0                       0                        8.0500
6  0                       0                        8.4583
7  0                       0                       51.8625
8  3                       1                       21.0750
13 0                       0                        8.0500

# Grouping Rows by Value

In [36]:
library(dplyr)

## Grouping rows by Gender and computing averages
titanic %>% group_by(Gender) %>% summarize(survived = mean(Survived), age = mean(Age), fare = mean(Fare))

  Gender survived  age      fare
1 man    0.1902269 30.43136 25.63394
2 woman  0.7420382 27.71975 44.47982

# Applying a Function Over all Elements in a Column

In [42]:
## Defining a function 
uppercase = function(x){return(toupper(x))}

## Applying the uppercase function to the Name column
head(lapply(titanic$Name, FUN = uppercase))

[[1]]
[1] "MR. OWEN HARRIS BRAUND"

[[2]]
[1] "MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER) CUMINGS"

[[3]]
[1] "MISS. LAINA HEIKKINEN"

[[4]]
[1] "MRS. JACQUES HEATH (LILY MAY PEEL) FUTRELLE"

[[5]]
[1] "MR. WILLIAM HENRY ALLEN"

[[6]]
[1] "MR. JAMES MORAN"